function PrivacyPolicy() {
  return (
    <div className="container mx-auto px-4 py-8">
      <h1 className="text-3xl font-bold mb-4">Политика конфиденциальности</h1>
      <p className="mb-4">
        В данной Политике конфиденциальности описывается, как собирается,
        используется и передается ваша персональная информация при посещении или
        совершении покупки на нашем сайте.
      </p>
      <h2 className="text-2xl font-bold mb-2">Какие данные мы собираем</h2>
      <p className="mb-4">
        При посещении сайта мы автоматически собираем определенную информацию о
        вашем устройстве, включая данные о вашем веб-браузере, IP-адресе,
        часовом поясе и некоторых установленных файлах cookie. Кроме того, во
        время просмотра сайта мы собираем информацию о посещаемых вами
        страницах, просмотренных товарах, источниках перехода на сайт и вашем
        взаимодействии с сайтом.
      </p>
      <h2 className="text-2xl font-bold mb-2">Как мы используем ваши данные</h2>
      <p className="mb-4">
        Собранные данные используются для выявления потенциальных рисков и
        мошенничества (например, проверка IP-адреса), а также для улучшения и
        оптимизации работы сайта (например, путем анализа поведения
        пользователей на сайте).
      </p>
      <h2 className="text-2xl font-bold mb-2">Передача вашей информации</h2>
      <p className="mb-4">
        Мы передаем вашу персональную информацию третьим лицам, чтобы
        использовать ее в указанных выше целях. Например, мы используем Google
        Analytics для анализа поведения пользователей на сайте.
      </p>
    </div>
  );
}

export default PrivacyPolicy;
